function plot_rocket()
v0 = 50; %вкажемо початкову швидкість тіла №1
x0= 0;%вкажемо початкові координати для тіла №1
y0= 0;
G = 9.8; %стала прискорення вільного падіння 
 
%вкажемо кут для тіла №1 та №2 , та переведемо значення в радіани
angle1 = 60;
a1 = pi * angle1 / 180;
angle2 = 30;
a2 = pi * angle2 / 180;
 
 
%обрахуємо час польоту для тіла №1
t_1 = (v0*sin(a1) + (v0^2*sin(a1)^2 + 2*G*y0)^0.5) / G;
%обрахуємо відстань польоту тіла №1
l = x0 + v0 * cos(a1) * t_1;
 
t1 = [0:0.05:t_1, t_1];
%обрахуємо координати польоту тіла №1
x1 = x0 + v0 * cos(a1) * t1;
y1 = y0 + v0 * sin(a1) * t1 - 0.5 * G * t1.^2;
 
%обрахуємо початкову швидкіть для тіла №2
v1=((l*G)/(2*cos(a2)*sin(a2)))^0.5
%обрахуємо час польоту для тіла №2
t_2 = (v1*sin(a2) + (v1^2*sin(a2)^2 + 2*G*y0)^0.5) / G;
t2 = [0:0.05:t_2, t_2];
%обрахуємо координати польоту тіла №2
x2 = l - v1 * cos(a2) * t2;
y2 = y0 + v1 * sin(a2) * t2 - 0.5 * G * t2.^2;
%виведемо отримані траєкторії
hold on
plot(x1,y1, x2, y2);
