//1.	Виконайте зашифрування тексту розшифрування тексту за допомогою шифру «Подвійний квадрат Уітстона».

// Н	А	Л	С	И	Т		Є	І	М	С	Ь	Т
// В	Ґ	Ф	Я	Д	.		Щ	В	Ї	Я	А	З
// І	К	У	Ш	_	П		Ц	Ч	,	Л	Е	К
// Ч	Й	Щ	Ї	Ц	Ж		.	Х	Н	Й	Б	Ф
// Е	Р	,	О	М	Ь		Р	_	Ґ	И	Ж	О
// Ю	Б	Х	Є	З	Г		Г	Д	Ш	У	Ю	П
//Зашифрувати
//НЕХАЙ_В_ТВОЇМ_СЕРЦІ_ЛЮБОВІ_НЕ_ЗГАСНЕ_СВЯЩЕНИЙ_ВОГОНЬ,_ЯК_ПЕРШЕ_ПРОМОВЛЕНЕ_СЛОВО_НА_МОВІ_НАРОДУ_СВОГО.
//Розшифрувати
//СЬ,ЦРРСФЕҐЙАВОТЕРҐФ,ЛИЗЕХОАЄБПИЄЛРЧДЬЖЙЕЧОВЕП,Т,ЇЦЧ,Ь_СЄЛДКИЖЧҐІЧДЦЕЬВЇШЕДХЬЗМЧЦТІМЦҐЇОПІМЬЯРЖЬВЦМП,ІЙКМЇЦИНЦЩ

#include <Windows.h>
#include <iostream>
using namespace std;

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    char table1[6][6] = { 
        {'Н','А','Л','С','И','Т'},
        {'В','Ґ','Ф','Я','Д','.'},
        {'І','К','У','Ш','_','П'},
        {'Ч','Й','Щ','Ї','Ц','Ж'},
        {'Е','Р',',','О','М','Ь'},
        {'Ю','Б','Х','Є','З','Г'}
    };
    char table2[6][6] = {
        {'Є','І','М','С','Ь','Т'},
        {'Щ','В','Ї','Я','А','З'},
        {'Ц','Ч',',','Л','Е','К'},
        {'.','Х','Н','Й','Б','Ф'},
        {'Р','_','Ґ','И','Ж','О'},
        {'Г','Д','Ш','У','Ю','П'},
    };

    int index[2][2];
    string code = "НЕХАЙ_В_ТВОЇМ_СЕРЦІ_ЛЮБОВІ_НЕ_ЗГАСНЕ_СВЯЩЕНИЙ_ВОГОНЬ,_ЯК_ПЕРШЕ_ПРОМОВЛЕНЕ_СЛОВО_НА_МОВІ_НАРОДУ_СВОГО.";
    for (int k = 0; k < code.size(); k += 2) {

        for (int i = 0; i < 6; i++) {
            for (int j=0; j < 6; j++) {
                if (code[k] == table1[i][j]) {
                    index[0][0] = i;
                    index[0][1] = j;
                }
            }
        }

        for (int i = 0; i < 6; i++) {
            for (int j=0; j < 6; j++) {
                if (code[k + 1] == table2[i][j]) {
                    index[1][0] = i;
                    index[1][1] = j;
                }
            }
        }
        cout << table2[index[0][0]][index[1][1]]<<table1[index[1][0]][index[0][1]];
    }

    return 0;
}